{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "PolyMC",
  "language": "en",
  "home_page_url": "https://polymc.github.io/",
  "feed_url": "https://polymc.github.io/feed/feed.json",
  "description": "An Open Source Minecraft launcher with the ability to manage multiple instances, accounts and mods. Focused on user freedom and free redistributability.",
  "author": {
    "name": "PolyMC",
    "url": "https://polymc.org/about/"
  },
  "items": [{
      "id": "https://polymc.github.io/news/moving-on/",
      "url": "https://polymc.github.io/news/moving-on/",
      "title": "Moving on",
      "content_html": "<p>PolyMC emerged out of frustration with the MultiMC project and therefore brought controversy with it.<br />\nIn short, the original founders of PolyMC had disagreements with the maintainer of MultiMC and the project's direction.<br />\nThese disagreements were turned into a takeover of packaging on Arch Linux by the PolyMC founders, something that, understandably, the <a href=\"https://github.com/PolyMC/PolyMC/issues/75#issuecomment-1023571223\">MultiMC maintainers took as sabotage</a>.<br />\nAfter MultiMC <a href=\"https://www.reddit.com/r/linux_gaming/comments/riitbs/multimc_is_dropping_all_support_for_aur_packages/\">dropped support for third-party packaging</a>, the seeds for PolyMC were laid.</p>\n<p>As a side note, we want to mention that we do not approve the actions of community members that used these controversies as a basis to harass MultiMC developers.<br />\nPlease refrain from brigading other communities.<br />\nIt only causes harm on both sides.</p>\n<p>PolyMC's inception is very controversial by its very nature.<br />\nThe founders have decided to sublicense PolyMC under the terms of the <a href=\"https://en.wikipedia.org/wiki/GNU_General_Public_License\">GNU General Public License 3</a> (GPL-3), which made it impossible for MultiMC to take contributions, without re-licensing to GPL-3 as well.<br />\nAs a result the MultiMC team have decided to burn bridges with PolyMC.<br />\nThis was manifested after access to the metadata service, provided by MultiMC, was <a href=\"https://github.com/PolyMC/PolyMC/issues/75\">blocked for all PolyMC users</a>.<br />\nAll versions prior to 1.0.6 do not work anymore, as they try to reach MultiMC servers instead of our own.</p>\n<p>In an effort to prepare for our upcoming 1.1.0 release, we wanted to contact the MultiMC maintainer to see, if they want to be credited in our documentation.<br />\nSadly, our request was dismissed, and most of our team members were banned from the official MultiMC Discord server for being associated with PolyMC.</p>\n<div class=\"center\">\n    <img alt=\"Screenshot of public chat with MultiMC maintainer\" src=\"https://polymc.github.io/img/news/moving-on/discord.png\" style=\"width: 40em\" />\n</div>\n<p>This has sparked many internal discussions both at PolyMC as well as MultiMC.<br />\nIn the end, we concluded that we will be moving on from our origins as a packaging-friendly fork of MultiMC.</p>\n<p>In our upcoming 1.1.0 release, you will be able to use new features that will differentiate PolyMC from MultiMC.<br />\nThe major new feature is the integrated mod downloader that supports Modrinth and CurseForge mods.<br />\nWe also plan to clean the codebase, remove obscure or old features and cruft in an effort to make it easier for new contributors to start working on PolyMC.</p>\n<p>Additionally, we have reorganized PolyMC since its inception to be more community-centric.<br />\nOne of the founders has stepped down as a maintainer and we have formed the <em>PolyMC Core Team</em>.<br />\nYou can read more about it in <a href=\"https://polymc.github.io/news/newmaintainers/\">this blogpost</a>.</p>\n<p>We want to decouple this project from its controversial origins and start work on a powerful Minecraft launcher.<br />\nWhile we are working on getting 1.1.0 out, check out our future plans:</p>\n<p><strong>Sneak peak of future plans</strong>:</p>\n<ul>\n<li>Rewrite of metadata generators, to make them easier to work with. See progress over on <a href=\"https://github.com/PolyMC/polymorphosis\">PolyMC/polymorphosis</a></li>\n<li>Potential rewrite of the launch-mechanism for Minecraft. This will give future alternative launchers the tools to build their own. See progress over on <a href=\"https://github.com/PolyMC/PolyMC/issues/167\">PolyMC/PolyMC#167</a></li>\n</ul>\n<p>If you want to be involved in PolyMC, check out the following links:</p>\n<ul>\n<li><a href=\"https://github.com/PolyMC\">PolyMC GitHub Organization</a></li>\n<li><a href=\"https://github.com/PolyMC/PolyMC\">PolyMC Source Code</a></li>\n<li><a href=\"https://discord.com/invite/xq7fxrgtMP\">PolyMC Discord server</a></li>\n<li><a href=\"https://matrix.to/#/#polymc:polymc.org\">PolyMC Matrix Space</a> (bridged with Discord)</li>\n</ul>\n<hr />\n<blockquote>\n<p>Never dig straight down!</p>\n</blockquote>\n<p>~ PolyMC Core Team</p>\n",
      "date_published": "2022-03-06T00:00:00Z"
    },{
      "id": "https://polymc.github.io/news/moddownload/",
      "url": "https://polymc.github.io/news/moddownload/",
      "title": "Modrinth support and Mod downloading",
      "content_html": "<p>Thanks to @timoreo it is now possible to download individual mods from both cursforge and modrinth this pull request is the first of many big changes coming to PolyMC.</p>\n<p>Screenshots of the new feature:</p>\n<p><img src=\"https://user-images.githubusercontent.com/81902668/152801619-8d826540-2467-4973-9488-f6afcb7ba804.png\" alt=\"ModInstallBlack\" /><br />\n<img src=\"https://user-images.githubusercontent.com/81902668/152801625-e7ad87f7-464f-49a2-ab4f-116f592acec1.png\" alt=\"ModInstallWhite\" /></p>\n",
      "date_published": "2022-02-07T00:00:00Z"
    },{
      "id": "https://polymc.github.io/news/new-maintainers/",
      "url": "https://polymc.github.io/news/new-maintainers/",
      "title": "New maintainers and step down.",
      "content_html": "<p>Based off recent controversies, and for the project's best interest, Swirl has stepped down from his role as maintainer. LennyMcLennington is now the head maintainer of PolyMC and has established a new core group of maintainers to keep the project healthy and active.</p>\n<p><strong>Swirl Stated</strong>:</p>\n<blockquote>\n<p>@here Based on recent controversies, and in thinking of the general future of this project, I believe it to be best if I step down from my leadership position in PolyMC.</p>\n<p>Lenny will now be maintaining PolyMC and all its related services, and will be establishing a core team to help with development resources and community management.</p>\n<p>Additionally, due to mental health and other personal reasons, I will be taking a break from--and generally will be unavailable for--contributing to the project.</p>\n<p>Thank you all for providing me a great community to work with. I pray for PolyMC to have a good future and for all of you to continue to do good for the Free Software community.</p>\n</blockquote>\n<p>Quote in news: <a href=\"https://discordapp.com/channels/923671181020766230/923672379144671263/939731859431100416\">Discord</a>, <a href=\"https://matrix.to/#/!oOkwnJBCfVOMgEOp:polymc.org/$yGu0hoOB36_bSVPnV8msXAHl7or12JHch7axAoCe-RY?via=polymc.org&amp;via=swirl.funny.cl&amp;via=matrix.org\">Element</a></p>\n<p>Swirl contributed a lot to PolyMC and we hope to see more contributions in the future.</p>\n<p>In lighter news, congratulations to our new Core Team consisting of:</p>\n<ul>\n<li>LennyMcLennington</li>\n<li>Scumplex</li>\n<li>timoreo</li>\n<li>txtsd</li>\n<li>dada513</li>\n<li>Ezekiel Smith</li>\n<li>cozyGalvinism</li>\n</ul>\n<p>We will be maintaining the PolyMC project and repositories. We hope to see great contributions and continued development of PolyMC.</p>\n<p>~ PolyMC Team</p>\n",
      "date_published": "2022-02-06T00:00:00Z"
    }
  ]
}
